Attribute VB_Name = "全局常量"
Public Const 绘制需求分割符 = ",", 节点编辑界面横偏移长度 = 150, 节点编辑界面纵偏移长度 = 150
Public Const 节点名绘制横偏移长度 = 150, 节点名绘制纵偏移长度 = -300, 初始节点颜色 = 16748574
Public Const 节点名自动生成前缀 = "d", 源点色 = 14822282
Public Const 节点运算符横偏移长度 = -300, 节点运算符纵偏移长度 = -300
Public Const 节点流值横偏移长度 = -400, 节点流值纵偏移长度 = 0
Public Const 节点序号横偏移长度 = 150, 节点序号纵偏移长度 = 0

Public Function 编码规则提示初始化() As String
    编码规则提示初始化 = "内容解析规则：" & vbCrLf & "1、一行默认为一个命令" & _
    vbCrLf & "2、空格分割命令与参数" & vbCrLf & "3、逗号分割参数" & _
    vbCrLf & vbCrLf & "命令如下：" & vbCrLf & "去 [其它节点名字] #代表从本节点连接到的节点" & _
    vbCrLf & "值 [数字] #代表本节点的初始值" & vbCrLf _
    & "算 [运算符号]#+(源+本)、-(源-本)、--(本-源)、*(源*本)、/(源÷本)、//(本÷源)、=(本=源)" & _
    vbCrLf & "上限 [数字] #阈值上限，超过将截止于此不进行运算" & vbCrLf _
    & "下限 [数字] #阈值下限，低于将截止于此不进行运算" & vbCrLf _
    & "常 #出现此字则意味着本节点是常数节点，常数节点的所有运算不会改变自身的值，但可以把自身值和源节点输出值的运算结果传递给下一个节点"
End Function
